docs/bookstore/alps.title.dot
digraph application_state_diagram {
  graph [
    labelloc="t";
    fontname="Helvetica"
  ];
  node [shape = box, style = "bold,filled" fillcolor="lightgray", margin="0.3,0.1"];

    Catalog [margin=0.1, label="Book Catalog", shape=box, URL="#Catalog" target="_parent"]
    Payment [margin=0.1, label="Payment Screen", shape=box, URL="#Payment" target="_parent"]

    Home -> Catalog [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCatalog" tooltip="Go to Catalog Screen (safe)"><font color="#00A86B">■</font> goToCatalog</td></tr></table>> URL="#goToCatalog" target="_parent" fontsize=13 class="goToCatalog" penwidth=1.5];
    Home -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCart" tooltip="Go to Cart Screen (safe)"><font color="#00A86B">■</font> goToCart</td></tr></table>> URL="#goToCart" target="_parent" fontsize=13 class="goToCart" penwidth=1.5];
    Catalog -> Catalog [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" align="left" href="#goListBooks" tooltip="Get Book List (safe)"><font color="#00A86B">■</font> goListBooks</td></tr><tr><td valign="middle" align="left" href="#goSearchBooks" tooltip="Search Books (safe)"><font color="#00A86B">■</font> goSearchBooks</td></tr><tr><td valign="middle" align="left" href="#goGetCategories" tooltip="Get Category List (safe)"><font color="#00A86B">■</font> goGetCategories</td></tr></table>> URL="#goListBooks" target="_parent" fontsize=13 class="goListBooks" penwidth=1.5];
    Catalog -> Book [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToBookDetails" tooltip="Go to Book Details Screen (safe)"><font color="#00A86B">■</font> goToBookDetails</td></tr></table>> URL="#goToBookDetails" target="_parent" fontsize=13 class="goToBookDetails" penwidth=1.5];
    Catalog -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCart" tooltip="Go to Cart Screen (safe)"><font color="#00A86B">■</font> goToCart</td></tr></table>> URL="#goToCart" target="_parent" fontsize=13 class="goToCart" penwidth=1.5];
    Book -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#doAddToCart" tooltip="Add to Cart (unsafe)"><font color="#FF4136">■</font> doAddToCart</td></tr></table>> URL="#doAddToCart" target="_parent" fontsize=13 class="doAddToCart" penwidth=1.5];
    Book -> Catalog [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCatalog" tooltip="Go to Catalog Screen (safe)"><font color="#00A86B">■</font> goToCatalog</td></tr></table>> URL="#goToCatalog" target="_parent" fontsize=13 class="goToCatalog" penwidth=1.5];
    ShoppingCart -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" align="left" href="#goListCartItems" tooltip="Get Cart Items List (safe)"><font color="#00A86B">■</font> goListCartItems</td></tr><tr><td valign="middle" align="left" href="#doUpdateQuantity" tooltip="Update Cart Item Quantity (idempotent)"><font color="#FFDC00">■</font> doUpdateQuantity</td></tr><tr><td valign="middle" align="left" href="#doRemoveFromCart" tooltip="Remove Item from Cart (idempotent)"><font color="#FFDC00">■</font> doRemoveFromCart</td></tr></table>> URL="#goListCartItems" target="_parent" fontsize=13 class="goListCartItems" penwidth=1.5];
    ShoppingCart -> Checkout [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCheckout" tooltip="Go to Checkout Screen (safe)"><font color="#00A86B">■</font> goToCheckout</td></tr></table>> URL="#goToCheckout" target="_parent" fontsize=13 class="goToCheckout" penwidth=1.5];
    ShoppingCart -> Catalog [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCatalog" tooltip="Go to Catalog Screen (safe)"><font color="#00A86B">■</font> goToCatalog</td></tr></table>> URL="#goToCatalog" target="_parent" fontsize=13 class="goToCatalog" penwidth=1.5];
    Checkout -> Checkout [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" align="left" href="#doUserInfo" tooltip="Input User Information (unsafe)"><font color="#FF4136">■</font> doUserInfo</td></tr><tr><td valign="middle" align="left" href="#doShippingInfo" tooltip="Input Shipping Information (unsafe)"><font color="#FF4136">■</font> doShippingInfo</td></tr></table>> URL="#doUserInfo" target="_parent" fontsize=13 class="doUserInfo" penwidth=1.5];
    Checkout -> Payment [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToPayment" tooltip="Go to Payment Screen (safe)"><font color="#00A86B">■</font> goToPayment</td></tr></table>> URL="#goToPayment" target="_parent" fontsize=13 class="goToPayment" penwidth=1.5];
    Checkout -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCart" tooltip="Go to Cart Screen (safe)"><font color="#00A86B">■</font> goToCart</td></tr></table>> URL="#goToCart" target="_parent" fontsize=13 class="goToCart" penwidth=1.5];
    Payment -> Payment [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" align="left" href="#doPaymentInfo" tooltip="Input Payment Information (unsafe)"><font color="#FF4136">■</font> doPaymentInfo</td></tr><tr><td valign="middle" align="left" href="#doPlaceOrder" tooltip="Place Order (unsafe)"><font color="#FF4136">■</font> doPlaceOrder</td></tr><tr><td valign="middle" align="left" href="#goOrderDetails" tooltip="Display Order Details (safe)"><font color="#00A86B">■</font> goOrderDetails</td></tr></table>> URL="#doPaymentInfo" target="_parent" fontsize=13 class="doPaymentInfo" penwidth=1.5];
    Payment -> Home [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToHome" tooltip="Go to Home Screen (safe)"><font color="#00A86B">■</font> goToHome</td></tr></table>> URL="#goToHome" target="_parent" fontsize=13 class="goToHome" penwidth=1.5];
    Payment -> ShoppingCart [label=<<table border="0" cellborder="0" cellspacing="0" cellpadding="0"><tr><td valign="middle" href="#goToCart" tooltip="Go to Cart Screen (safe)"><font color="#00A86B">■</font> goToCart</td></tr></table>> URL="#goToCart" target="_parent" fontsize=13 class="goToCart" penwidth=1.5];

    Home [label="Home Screen" URL="#Home" target="_parent"]
    Catalog [label="Book Catalog" URL="#Catalog" target="_parent"]
    ShoppingCart [label="Shopping Cart" URL="#ShoppingCart" target="_parent"]
    Book [label="Book" URL="#Book" target="_parent"]
    Checkout [label="Checkout Screen" URL="#Checkout" target="_parent"]
    Payment [label="Payment Screen" URL="#Payment" target="_parent"]

}
